# Comandos para roteadores Cisco (Sem a necessidade de privilégio)

## ">" indica o modo em que estamos, no caso o modo sem privilégio.

## Comando help
### Comando que mostra os comandos disponíveis e paramêtros necessários para usar outros comandos:

```
> ?
```

## Ping
### Comando básico para testar conexão:

```
> ping <ip de destino>
```

## Traceroute
### Comando para verificar os "hops" feitos até o destino:

```
> traceroute <IP/Dominio> do destino
```

## Show
### Comando para visualizar configurações do router, como interfaces, rotas, user, etc:

```
> show <configuração a ser visualizada>
```

## Enable
### Comando para entrar no modo de Administrador do equipamento:

```
> enable
```

## Outros a serem testados e adicionados